Cases/0.3mps/system/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  2312
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

limitT
{
    type            limitTemperature;
    libs            (fvModels);
    active          true;
    selectionMode   all;

    // 👈 💥 어떤 솔버든 상관없이 온도가 이 범위를 벗어나면 강제로 대가리 찍어 누르기!
    min             200;
    max             2500;
}