Cases/0.3mps/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

outlet.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150; 
    subsetFeatures
    {
        nonManifoldEdges       no;
        openEdges              yes;
    }
    writeObj            yes;
}

inlet.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150; 
    subsetFeatures
    {
        nonManifoldEdges       no;
        openEdges              yes;
    }
    writeObj            yes;
}

wall.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150; 
    subsetFeatures
    {
        nonManifoldEdges       no;
        openEdges              yes;
    }
    writeObj            yes;
}

// ************************************************************************* //